In [56]:
import pandas as pd 
import numpy as np
from scipy import stats
from scipy.stats import norm
from scipy.stats import chi2_contingency

# Q1 cutlets

In [19]:
cutlets= pd.read_csv("Cutlets.csv")

In [20]:
cutlets.tail()

    Unit A  Unit B
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [ ]:
#null hypothesis(H0): data is normal
# alternate hypothesis(H1): data is not normal

In [21]:
UnitA= pd.Series(cutlets.iloc[:,0])

In [22]:
UnitA

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [24]:
UnitB=pd.Series(cutlets.iloc[:,1])
UnitB

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [28]:
p_values=stats.ttest_ind(UnitA, UnitB)

In [29]:
p_values

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [30]:
p_values[0]

0.7228688704678063

In [31]:
p_values[1]

0.4722394724599501

In [ ]:
#compairing p_value 
# (p_value=0.4722)>0.05
#then we accept alternate hypothesis that the data is not normal

# Q2 labtat

In [32]:
labtat= pd.read_csv("LabTaT.csv")

In [33]:
labtat

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [37]:
# to check the mean of two or more groups is equal we use anova test 
p_value= stats.f_oneway(labtat.iloc[:,0],labtat.iloc[:,1],labtat.iloc[:,2],labtat.iloc[:,3])

In [39]:
p_value

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [ ]:
# here p_value(2.11)>0.05 
# so we reject the null hypothesis 
# there is difference between the mean of the reports of the labs

# Q3 buyers ratio

In [43]:
buyerratio=pd.read_csv("BuyerRatio.csv")

In [44]:
buyerratio

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [ ]:
# H0= male female buyer ratio is same
# H1+ male female buyer ratio  is not same

In [45]:
df= buyerratio.iloc[:,1:]

In [46]:
df

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [54]:
# here the columns are categorical so we use chi square test
p_value=chi2_contingency (df)
p_value[1]

0.6603094907091882

In [ ]:
# here p_value(0.6603) > (a =0.05) so from the question 
# we accept the null hypothesis
# therefore, male and female buyer are similar accross regions.

# Q4customer order

In [60]:
customer_order=pd.read_csv("Costomer+OrderForm.csv")

In [61]:
customer_order

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [64]:
Phillippines=customer_order.Phillippines.value_counts()
Phillippines_error_free=Phillippines[0]
Phillippines_defective=Phillippines[1]

In [65]:
Indonesia=customer_order.Indonesia.value_counts()
Indonesia_error_free=Indonesia[0]
Indonesia_defective=Indonesia[1]

In [66]:
Malta=customer_order.value_counts()
Malta_error_free=Malta[0]
Malta_defective=Malta[1]

In [69]:
India=customer_order.value_counts()
India_error_free=India[0]
India_defective=India[1]

In [70]:
df=[[Phillippines_error_free,Indonesia_error_free,Malta_error_free,India_error_free],
   [Phillippines_defective,Indonesia_defective,Malta_defective,India_defective]]

In [71]:
df

[[271, 267, 206, 206], [29, 33, 21, 21]]

In [75]:
p_value=chi2_contingency(df)
p_value

(0.6401968943028528,
 0.8871716494290035,
 3,
 array([[270.39848197, 270.39848197, 204.60151803, 204.60151803],
        [ 29.60151803,  29.60151803,  22.39848197,  22.39848197]]))

In [ ]:
#here p_value > a=0.05
# so we accept the alternate hypothesis